EDT/УТ/src/Reports/ОтчетКонтроляВремени/ОтчетКонтроляВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчетКонтроляВремени</name>
</mdclass:Report>

EDT/УТ/src/InformationRegisters/ПараметрыРегиональныхТерминалов/ПараметрыРегиональныхТерминалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыРегиональныхТерминалов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>РежимНазначенияНомеровПалетПриМаршрутизации</name>
    <type>
      <types>EnumRef.РежимыНазначенияНомеровПалет</types>
    </type>
  </resources>
  <resources>
    <name>МетодикаЛогистическойМаршрутизации</name>
    <type>
      <types>EnumRef.МетодикаЛогистическойМаршрутизации</types>
    </type>
  </resources>
  <resources>
    <name>СхемаНазначенияНомеровПалетПоПолигонам</name>
    <type>
      <types>CatalogRef.СхемыНазначенияНомеровПалетПоПолигонам</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьОпределениеСменыМаршрутизации</name>
    <type>
      <types>CatalogRef.Смены</types>
    </type>
  </resources>
  <resources>
    <name>ЗонаТарификацииЗаказовСамовывоза</name>
    <type>
      <types>CatalogRef.ГруппыРайонов</types>
    </type>
  </resources>
  <dimensions>
    <name>РегиональныйТерминал</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/КонтрольВремени/КонтрольВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтрольВремени</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ОкончаниеСобытия</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМеста</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Терминал</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Событие</name>
    <type>
      <types>CatalogRef.СобытияКонтроляВремени</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Рейс</name>
    <type>
      <types>DocumentRef.Рейс</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаРейсов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Enums/МетодикаЛогистическойМаршрутизации/МетодикаЛогистическойМаршрутизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>МетодикаЛогистическойМаршрутизации</name>
  <enumValues>
    <name>МаршрутизацияVeeroute</name>
  </enumValues>
  <enumValues>
    <name>ПолигональнаяМаршрутизация</name>
  </enumValues>
  <enumValues>
    <name>ВнешняяМаршрутизация</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Reports/ОтчетКонтроляВремени/ObjectModule.bsl
Перем ТриЧаса;
Перем ДатаОтч;
Перем Терминал;

Функция СформироватьОтправитьПоПочте(Период, Терминал) Экспорт
	//Форма = Получитьформу("Отчет.ОтчетКонтроляВремени.Форма.ФормаОтчета");
	Р = СформироватьОтчет(Период, Терминал);
	Если Р.ВысотаТаблицы > 8 Тогда
		Возврат Р;
	Иначе
		Возврат Неопределено;
	КонецеСли;
КонецФункции

//&НаКлиенте
Функция СформироватьОтчет(ДатаС, ТерминалДоставки) Экспорт
	
	ДатаОтч = ДатаС;
	Терминал = ТерминалДоставки;
	Табл = Новый ТабличныйДокумент;
	Макет = Отчеты.ОтчетКонтроляВремени.ПолучитьМакет("Макет");
	
	ВывестиКонтрагентов(Табл, Макет);
	
	// Якурнов 31.07.2018 13:22:40
	МетодМаршрутизации = ПолучитьМетодикуЛогистическойМаршрутизации(Терминал);
	Если МетодМаршрутизации = Перечисления.МетодикаЛогистическойМаршрутизации.МаршрутизацияVeeroute Тогда
		Построитель = Новый ПостроительОтчета;
		Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(ПолучитьДанныеЗапросаПоМетодуVeeroute());
		Построитель.МакетШапкиТаблицы     = Макет.ПолучитьОбласть("Шапка");
		Построитель.МакетДетальныхЗаписей = Макет.ПолучитьОбласть("Строка");
	Иначе
		
		Построитель = Новый ПостроительОтчета;
		Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(ПолучитьДанныеЗапросаПоМетодуПМ());
		Построитель.МакетШапкиТаблицы     = Макет.ПолучитьОбласть("ШапкаПМ");
		Построитель.МакетДетальныхЗаписей = Макет.ПолучитьОбласть("СтрокаПМ");
	КонецЕсли;
	//Макет = Построитель.Макет;
	//Область = Макет.Область();
	//Область.ШиринаКолонки = 15;
	//Макет.Область("C1").ШиринаКолонки = 3;
	//Макет.Область("C2").ШиринаКолонки = 10;
	//Макет.Область("C3").ШиринаКолонки = 20;
	//Макет.Область("C4").ШиринаКолонки = 20;
	//Макет.Область("C5").ШиринаКолонки = 20;
	//Построитель.Макет = Макет;
	//Построитель.ОформитьМакет();
	
	Табл.АвтоМасштаб = Истина;	
	Табл.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	Построитель.Вывести(Табл);
	Возврат Табл;
	
КонецФункции

// Якурнов 31.07.2018 13:07:54 Определяем МетодикуЛогистическойМаршрутизации
//&НаСервере
Функция ПолучитьМетодикуЛогистическойМаршрутизации(Терминал)
	
	Если НЕ ЗначениеЗаполнено(Терминал) Тогда	
		Терминал = ПараметрыСеанса.ТерминалДоставки;		
	КонецЕсли;
	МетодикаЛогистическойМаршрутизации = Перечисления.МетодикаЛогистическойМаршрутизации.МаршрутизацияVeeroute;

	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	ПараметрыРегиональныхТерминаловСрезПоследних.МетодикаЛогистическойМаршрутизации КАК МетодикаЛогистическойМаршрутизации
	            |ИЗ
	            |	РегистрСведений.ПараметрыРегиональныхТерминалов.СрезПоследних(, РегиональныйТерминал.Ссылка = &Терминал) КАК ПараметрыРегиональныхТерминаловСрезПоследних";
	Зап.УстановитьПараметр("Терминал", Терминал);
	Выб = Зап.Выполнить().Выбрать();
	
	Пока Выб.Следующий() Цикл
		Если ЗначениеЗаполнено(Выб.МетодикаЛогистическойМаршрутизации)Тогда
			МетодикаЛогистическойМаршрутизации = Выб.МетодикаЛогистическойМаршрутизации;
		КонецЕсли;
	КонецЦикла;	

	
	Возврат МетодикаЛогистическойМаршрутизации;
КонецФункции


//&НаСервере
Функция ПолучитьДанныеЗапросаПоМетодуVeeroute()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КонтрольВремени.Рейс.НомерПалетты КАК Номер,
	               |	КонтрольВремени.Рейс.РейсМестнойДоставки.Транспорт КАК Транспорт,
	               |	КонтрольВремени.Рейс.РейсМестнойДоставки.Водитель КАК Водитель,
	               |	КонтрольВремени.Рейс.РейсМестнойДоставки.Экспедитор КАК Экспедитор,
	               |	МАКСИМУМ(КонтрольВремени.Период) КАК РаспечаткаМаршрутногоЛиста,
	               |	КонтрольВремени.Рейс КАК Рейс
	               |ПОМЕСТИТЬ ТМаршрутныйДист
	               |ИЗ
	               |	РегистрСведений.КонтрольВремени КАК КонтрольВремени
	               |ГДЕ
	               |	КонтрольВремени.Период МЕЖДУ &ДатаНач И &ДатаКон
	               |	И КонтрольВремени.ОкончаниеСобытия = ИСТИНА
	               |	И КонтрольВремени.Событие = &РаспечаткаМаршрутногоЛиста
	               |	И КонтрольВремени.Терминал = &Терминал
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	КонтрольВремени.Рейс,
	               |	КонтрольВремени.Рейс.РейсМестнойДоставки.Транспорт,
	               |	КонтрольВремени.Рейс.РейсМестнойДоставки.Водитель,
	               |	КонтрольВремени.Рейс.РейсМестнойДоставки.Экспедитор,
	               |	КонтрольВремени.Рейс.НомерПалетты
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МАКСИМУМ(КонтрольВремени.Период) КАК ОкончаниеЗагрузкиВАвто,
	               |	КонтрольВремени.Рейс КАК Рейс
	               |ПОМЕСТИТЬ ТОкончаниеЗагрузки
	               |ИЗ
	               |	РегистрСведений.КонтрольВремени КАК КонтрольВремени
	               |ГДЕ
	               |	КонтрольВремени.Период МЕЖДУ &ДатаНач И &ДатаКон
	               |	И КонтрольВремени.ОкончаниеСобытия = ИСТИНА
	               |	И КонтрольВремени.Событие = &ОкончаниеЗагрузкиВАвто
	               |	И КонтрольВремени.Терминал = &Терминал
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	КонтрольВремени.Рейс
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МАКСИМУМ(КонтрольВремени.Период) КАК РаспечаткаРазблюдовкиСклад,
	               |	КонтрольВремени.Рейс КАК Рейс
	               |ПОМЕСТИТЬ ТРаспечаткаРазблюдовкиСклад
	               |ИЗ
	               |	РегистрСведений.КонтрольВремени КАК КонтрольВремени
	               |ГДЕ
	               |	КонтрольВремени.Период МЕЖДУ &ДатаНач И &ДатаКон
	               |	И КонтрольВремени.ОкончаниеСобытия = ИСТИНА
	               |	И КонтрольВремени.Событие = &РаспечаткаРазблюдовкиСклад
	               |	И КонтрольВремени.Терминал = &Терминал
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	КонтрольВремени.Рейс
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Т1.Номер КАК Номер,
	               |	Т1.Транспорт КАК Транспорт,
	               |	Т1.Водитель КАК Водитель,
	               |	Т1.Экспедитор КАК Экспедитор,
	               |	Т1.РаспечаткаМаршрутногоЛиста КАК РаспечаткаМаршрутногоЛиста,
	               |	Т2.ОкончаниеЗагрузкиВАвто КАК ОкончаниеЗагрузкиВАвто,
	               |	Т3.РаспечаткаРазблюдовкиСклад КАК РаспечаткаРазблюдовкиСклад,
	               |	ВложенныйЗапрос.Период КАК ВыгрузкаИз1СВВероут,
	               |	ВложенныйЗапрос1.Период КАК ЗагрузкаРейсовИзВероут
	               |ИЗ
	               |	ТМаршрутныйДист КАК Т1
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТОкончаниеЗагрузки КАК Т2
	               |		ПО Т1.Рейс = Т2.Рейс
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТРаспечаткаРазблюдовкиСклад КАК Т3
	               |		ПО Т1.Рейс = Т3.Рейс,
	               |	(ВЫБРАТЬ
	               |		МИНИМУМ(КонтрольВремениСрезПоследних.Период) КАК Период
	               |	ИЗ
	               |		РегистрСведений.КонтрольВремени КАК КонтрольВремениСрезПоследних
	               |	ГДЕ
	               |		КонтрольВремениСрезПоследних.Событие = &ВыгрузкаИз1СВВероут
	               |		И КонтрольВремениСрезПоследних.Период МЕЖДУ &ДатаНач И &ДатаКон
	               |		И КонтрольВремениСрезПоследних.ОкончаниеСобытия = ИСТИНА
	               |		И КонтрольВремениСрезПоследних.Терминал = &Терминал) КАК ВложенныйЗапрос,
	               |	(ВЫБРАТЬ
	               |		МИНИМУМ(КонтрольВремениСрезПоследних.Период) КАК Период
	               |	ИЗ
	               |		РегистрСведений.КонтрольВремени КАК КонтрольВремениСрезПоследних
	               |	ГДЕ
	               |		КонтрольВремениСрезПоследних.Период МЕЖДУ &ДатаНач И &ДатаКон
	               |		И КонтрольВремениСрезПоследних.ОкончаниеСобытия = ИСТИНА
	               |		И КонтрольВремениСрезПоследних.Событие = &ЗагрузкаРейсовИзВероут
	               |		И КонтрольВремениСрезПоследних.Терминал = &Терминал) КАК ВложенныйЗапрос1
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Номер
	               |АВТОУПОРЯДОЧИВАНИЕ";			   
	Запрос.УстановитьПараметр("ДатаНач", НачалоДня(ДатаОтч) - ТриЧаса);
	Запрос.УстановитьПараметр("ДатаКон", КонецДня(ДатаОтч) - ТриЧаса);
	
	Запрос.УстановитьПараметр("РаспечаткаМаршрутногоЛиста", Справочники.СобытияКонтроляВремени.РаспечаткаМаршрутногоЛиста);
	Запрос.УстановитьПараметр("ОкончаниеЗагрузкиВАвто", Справочники.СобытияКонтроляВремени.ОкончаниеЗагрузкиВАвто);	
	Запрос.УстановитьПараметр("ВыгрузкаИз1СВВероут", Справочники.СобытияКонтроляВремени.ВыгрузкаИз1СВВероут);
	Запрос.УстановитьПараметр("ЗагрузкаРейсовИзВероут", Справочники.СобытияКонтроляВремени.ЗагрузкаРейсовИзВероут);
	Запрос.УстановитьПараметр("РаспечаткаРазблюдовкиСклад", Справочники.СобытияКонтроляВремени.РаспечаткаРазблюдовкиСклад);
	// МАС - 08.06.2017 - №972 --->> 
	Если НЕ ЗначениеЗаполнено(Терминал) Тогда	
		Терминал = ПараметрыСеанса.ТерминалДоставки;		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Терминал", Терминал);
	// <<--- МАС 
	
	Возврат Запрос.Выполнить().Выгрузить();	
	
КонецФункции

// Якурнов 31.07.2018 13:27:37
//&НаСервере
Функция ПолучитьДанныеЗапросаПоМетодуПМ()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КонтрольВремени.Рейс.НомерПалетты КАК Номер,
	               |	КонтрольВремени.Рейс.РейсМестнойДоставки.Транспорт КАК Транспорт,
	               |	КонтрольВремени.Рейс.РейсМестнойДоставки.Водитель КАК Водитель,
	               |	КонтрольВремени.Рейс.РейсМестнойДоставки.Экспедитор КАК Экспедитор,
	               |	МАКСИМУМ(КонтрольВремени.Период) КАК РаспечаткаМаршрутногоЛиста,
	               |	КонтрольВремени.Рейс КАК Рейс
	               |ПОМЕСТИТЬ ТМаршрутныйДист
	               |ИЗ
	               |	РегистрСведений.КонтрольВремени КАК КонтрольВремени
	               |ГДЕ
	               |	КонтрольВремени.Период МЕЖДУ &ДатаНач И &ДатаКон
	               |	И КонтрольВремени.ОкончаниеСобытия = ИСТИНА
	               |	И КонтрольВремени.Событие = &РаспечаткаМаршрутногоЛиста
	               |	И КонтрольВремени.Терминал = &Терминал
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	КонтрольВремени.Рейс,
	               |	КонтрольВремени.Рейс.РейсМестнойДоставки.Транспорт,
	               |	КонтрольВремени.Рейс.РейсМестнойДоставки.Водитель,
	               |	КонтрольВремени.Рейс.РейсМестнойДоставки.Экспедитор,
	               |	КонтрольВремени.Рейс.НомерПалетты
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МАКСИМУМ(КонтрольВремени.Период) КАК ОкончаниеЗагрузкиВАвто,
	               |	КонтрольВремени.Рейс КАК Рейс
	               |ПОМЕСТИТЬ ТОкончаниеЗагрузки
	               |ИЗ
	               |	РегистрСведений.КонтрольВремени КАК КонтрольВремени
	               |ГДЕ
	               |	КонтрольВремени.Период МЕЖДУ &ДатаНач И &ДатаКон
	               |	И КонтрольВремени.ОкончаниеСобытия = ИСТИНА
	               |	И КонтрольВремени.Событие = &ОкончаниеЗагрузкиВАвто
	               |	И КонтрольВремени.Терминал = &Терминал
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	КонтрольВремени.Рейс
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МАКСИМУМ(КонтрольВремени.Период) КАК РаспечаткаРазблюдовкиСклад,
	               |	КонтрольВремени.Рейс КАК Рейс
	               |ПОМЕСТИТЬ ТРаспечаткаРазблюдовкиСклад
	               |ИЗ
	               |	РегистрСведений.КонтрольВремени КАК КонтрольВремени
	               |ГДЕ
	               |	КонтрольВремени.Период МЕЖДУ &ДатаНач И &ДатаКон
	               |	И КонтрольВремени.ОкончаниеСобытия = ИСТИНА
	               |	И КонтрольВремени.Событие = &РаспечаткаРазблюдовкиСклад
	               |	И КонтрольВремени.Терминал = &Терминал
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	КонтрольВремени.Рейс
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Т1.Номер КАК Номер,
	               |	Т1.Транспорт КАК Транспорт,
	               |	Т1.Водитель КАК Водитель,
	               |	Т1.Экспедитор КАК Экспедитор,
	               |	Т1.РаспечаткаМаршрутногоЛиста КАК РаспечаткаМаршрутногоЛиста,
	               |	Т2.ОкончаниеЗагрузкиВАвто КАК ОкончаниеЗагрузкиВАвто,
	               |	Т3.РаспечаткаРазблюдовкиСклад КАК РаспечаткаРазблюдовкиСклад,
	               |	ВложенныйЗапрос.Период КАК ПМФиксацияМаршрутизации,
	               |	ВложенныйЗапрос1.Период КАК ПМФормированиеРейсов
	               |ИЗ
	               |	ТМаршрутныйДист КАК Т1
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТОкончаниеЗагрузки КАК Т2
	               |		ПО Т1.Рейс = Т2.Рейс
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТРаспечаткаРазблюдовкиСклад КАК Т3
	               |		ПО Т1.Рейс = Т3.Рейс,
	               |	(ВЫБРАТЬ
	               |		МИНИМУМ(КонтрольВремениСрезПоследних.Период) КАК Период
	               |	ИЗ
	               |		РегистрСведений.КонтрольВремени КАК КонтрольВремениСрезПоследних
	               |	ГДЕ
	               |		КонтрольВремениСрезПоследних.Событие = &ПМФиксацияМаршрутизации
	               |		И КонтрольВремениСрезПоследних.Период МЕЖДУ &ДатаНач И &ДатаКон
	               |		И КонтрольВремениСрезПоследних.ОкончаниеСобытия = ИСТИНА
	               |		И КонтрольВремениСрезПоследних.Терминал = &Терминал) КАК ВложенныйЗапрос,
	               |	(ВЫБРАТЬ
	               |		МИНИМУМ(КонтрольВремениСрезПоследних.Период) КАК Период
	               |	ИЗ
	               |		РегистрСведений.КонтрольВремени КАК КонтрольВремениСрезПоследних
	               |	ГДЕ
	               |		КонтрольВремениСрезПоследних.Период МЕЖДУ &ДатаНачФормРейс И &ДатаКон
	               |		И КонтрольВремениСрезПоследних.ОкончаниеСобытия = ИСТИНА
	               |		И КонтрольВремениСрезПоследних.Событие = &ПМФормированиеРейсов
	               |		И КонтрольВремениСрезПоследних.Терминал = &Терминал) КАК ВложенныйЗапрос1
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Номер
	               |АВТОУПОРЯДОЧИВАНИЕ";			   
	Запрос.УстановитьПараметр("ДатаНач", НачалоДня(ДатаОтч) - ТриЧаса);
	Запрос.УстановитьПараметр("ДатаНачФормРейс", НачалоДня(ДатаОтч) - 4*ТриЧаса);
	Запрос.УстановитьПараметр("ДатаКон", КонецДня(ДатаОтч) - ТриЧаса);
	
	Запрос.УстановитьПараметр("РаспечаткаМаршрутногоЛиста", Справочники.СобытияКонтроляВремени.РаспечаткаМаршрутногоЛиста);
	Запрос.УстановитьПараметр("ОкончаниеЗагрузкиВАвто", Справочники.СобытияКонтроляВремени.ОкончаниеЗагрузкиВАвто);	
	Запрос.УстановитьПараметр("ПМФормированиеРейсов", Справочники.СобытияКонтроляВремени.ПМФормированиеРейсов);
	Запрос.УстановитьПараметр("ПМФиксацияМаршрутизации", Справочники.СобытияКонтроляВремени.ПМФиксацияМаршрутизации);
	Запрос.УстановитьПараметр("РаспечаткаРазблюдовкиСклад", Справочники.СобытияКонтроляВремени.РаспечаткаРазблюдовкиСклад);
	// МАС - 08.06.2017 - №972 --->> 
	Если НЕ ЗначениеЗаполнено(Терминал) Тогда	
		Терминал = ПараметрыСеанса.ТерминалДоставки;		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Терминал", Терминал);
	// <<--- МАС 
	
	Возврат Запрос.Выполнить().Выгрузить();	
	
КонецФункции

//&НаСервере
Процедура ВывестиКонтрагентов(Табл, Макет)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтрольВремени.Контрагент КАК Контрагент,
		|	КонтрольВремени.Период КАК Период
		|ИЗ
		|	РегистрСведений.КонтрольВремени КАК КонтрольВремени
		|ГДЕ
		|	КонтрольВремени.Период МЕЖДУ &ДатаНач И &ДатаКон
		|	И КонтрольВремени.Событие = &Событие
		|	И КонтрольВремени.Терминал = &Терминал
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период
		|АВТОУПОРЯДОЧИВАНИЕ";
		
	ТриЧаса = 60 * 60 * 3;	
	Запрос.УстановитьПараметр("ДатаНач", НачалоДня(ДатаОтч) - ТриЧаса);
	Запрос.УстановитьПараметр("ДатаКон", КонецДня(ДатаОтч) - ТриЧаса);
	Запрос.УстановитьПараметр("Событие", Справочники.СобытияКонтроляВремени.ПриездАвтоКомитента);
	// МАС - 08.06.2017 - №972 --->> 
	Если НЕ ЗначениеЗаполнено(Терминал) Тогда	
		Терминал = ПараметрыСеанса.ТерминалДоставки;		
	КонецЕсли;
	Запрос.УстановитьПараметр("Терминал", Терминал);
	// <<--- МАС
	
	Рез = Запрос.Выполнить().Выбрать();
	ОбластьШапка = Макет.ПолучитьОбласть("ШапкаКонтрагент");
	ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаКонтрагент");
	
	Табл.Вывести(ОбластьШапка);
	П = ОбластьСтрока.Параметры;
	Номер = 0;
	Пока Рез.Следующий() Цикл
		Номер = Номер + 1;
		П.Номер = Номер;
		П.Контрагент = Рез.Контрагент;
		П.Период = Рез.Период;
		Табл.Вывести(ОбластьСтрока);
	КонецЦикла;
КонецПроцедуры
